#+PROPERTY: header-args:R :session *R:dimred*
#+PROPERTY: header-args:R+ :output-dir /home/johannes/Dropbox/phd/papers/closing/notes/dimred/
#+PROPERTY: header-args:R+ :tangle yes

#+latex_class: article_usual2
# erases make title
# #+BIND: org-export-latex-title-command ""

# fucks all the maketitlestuff just to be sure
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: h:5

** look at stability if only open museums are used for principal component construction

woclosed: PCA loadings are calculated only with open museums, then scores for closed museums are calculated from those loadings


#+name: p_cpr_loads_scatter
#+begin_src R :exports results :results output graphics file :file p_cpr_loads_scatter.pdf :width 14 :height 8
## compare loadings

## reshaping fun https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html
## value.name keyword

dt_pca_cpr_loads <- map2(list(l_pca_dimred, l_pca_dimred_woclosed), list("all", "woclosed"),
     ~chuck(.x, "rotatedLoadings")[, 1:2] %>% adt(keep.rownames = "vrbl") %>% .[, src := .y]) %>%
    rbindlist %>% dcast(vrbl ~ src, value.var  = c("PC1", "PC2")) 

## compare loadings plot 1

dt_pca_cpr_loads %>% melt(id.vars = "vrbl", measure.vars = measure(value.name, src, sep = "_")) %>%
    .[src == "woclosed", `:=`(PC1 = PC1 * -1, PC2 = PC2 * -1)] %>% # align PCs (get twisted sometimes/how)
    ggplot(aes(x=PC1, y=PC2, label = vrbl, color = src)) +
    geom_point() +  geom_text_repel(show.legend = F, size = 5) + 
    geom_segment(dt_pca_cpr_loads, mapping = aes(x=PC1_all, y=PC2_all, xend = PC1_woclosed*-1,
                                                 yend = PC2_woclosed*-1), color = "black")


#+end_src

#+attr_latex: :width 16cm
#+RESULTS: p_cpr_loads_scatter
[[file:/home/johannes/Dropbox/phd/papers/closing/notes/dimred/p_cpr_loads_scatter.pdf]]

#+name: p_cpr_loads_cols
#+begin_src R :exports results :results output graphics file :file p_cpr_loads_cols.pdf :width 7 :height 5
## compare loadings plot2
dt_pca_cpr_loads %>% melt(id.vars = "vrbl", measure.vars = measure(PC, src, sep = "_")) %>%
    .[src == "woclosed", value := value *-1] %>% 
    ggplot(aes(x=value, y=vrbl, fill = src)) + geom_col(position = position_dodge()) +
    facet_grid(~PC)
#+end_src

#+attr_latex: width 7in
#+RESULTS: p_cpr_loads_cols
[[file:/home/johannes/Dropbox/phd/papers/closing/notes/dimred/p_cpr_loads_cols.pdf]]

-> not a big difference between factor loadings with all museums (all) and without closed (woclosed, i.e. only open museums)

look at correlations of loadings: 

#+begin_src R :exports results :results output
dt_pca_cpr_loads[, .SD, .SDcols = patterns("^PC")] %>% cor %>%
  multiply_by(lower.tri(.)) %>% # only keep one side
  adt(keep.rownames = "PC") %>%
  melt(id.vars = "PC", measure.vars = measure(PC_cpr, src_cpr, sep = "_"), value.name = "cor") %>% 
  .[cor != 0] %>% 
  .[, c("PC_org", "src_org") := tstrsplit(PC, "_")] %>%
  .[PC_org == PC_cpr & src_org != src_cpr, .(PC_cpr, src_cpr, src_org, cor = round(cor, 3))]
  #+end_src

#+RESULTS:
: # A data frame: 2 × 4
:   PC_cpr src_cpr src_org     cor
:   <chr>  <chr>   <chr>     <dbl>
: 1 PC1    all     woclosed -0.998
: 2 PC2    all     woclosed -0.986

-> correlations of loadings are super high: 0.99, 0.98




next: compare scores:

#+begin_src R :exports results :results output
## compare scores
dt_pca_cpr_scores <- map2(list(l_pca_dimred, l_pca_dimred_woclosed), list("all", "woclosed"),
                          ~chuck(.x, "dt_scores")[, src := .y]) %>% rbindlist %>%
                     dcast(ID + museum_status ~ src, value.var  = c("PC1", "PC2")) 

## correlation of scores are pretty high too: 0.99
dt_pca_cpr_scores[, .SD, .SDcols = patterns("^PC")] %>% cor(use = "complete.obs") %>%
    multiply_by(lower.tri(.)) %>% # only keep one side
  adt(keep.rownames = "PC") %>%
  melt(id.vars = "PC", measure.vars = measure(PC_cpr, src_cpr, sep = "_"), value.name = "cor") %>% 
  .[cor != 0] %>% 
  .[, c("PC_org", "src_org") := tstrsplit(PC, "_")] %>%
  .[PC_org == PC_cpr & src_org != src_cpr, .(PC_cpr, src_cpr, src_org, cor = round(cor, 3))]

#+end_src

#+RESULTS:
: # A data frame: 2 × 4
:   PC_cpr src_cpr src_org     cor
:   <chr>  <chr>   <chr>     <dbl>
: 1 PC1    all     woclosed -0.999
: 2 PC2    all     woclosed -0.997

also super high: 0.99 for both PC1 and PC2

look at scores: 

#+name: p_cpr_scores_scat
#+begin_src R :exports results :results output graphics file :file p_cpr_scores_scat.pdf :width 7 :height 4

## https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reshape.html
## somehow using sep + cols doesn't work -> have to use pattern, which does work: 
## this doesn't work
## melt(dt_pca_cpr_scores, id.vars =  c("ID", "museum_status"),
##      measure.vars = measure(value.name, src, sep = "_",
##                             cols = c("PC1_all", "PC1_woclosed","PC2_all", "PC2_woclosed")))

melt(dt_pca_cpr_scores, id.vars =  c("ID", "museum_status"),
     measure.vars = measure(value.name, src, pattern = "(PC.*)_(.*)")) %>%
    .[src == "woclosed" , `:=`(PC1 = PC1*-1, PC2 = PC2 *-1)] %>% 
    ggplot(aes(x=PC1, y=PC2, color = museum_status)) +
    geom_jitter(width = 0.3, height = 0.3, size = 0.5) + 
    facet_wrap(~src, scales = "free") +
    theme(legend.position = "bottom")

#+end_src

#+attr_latex: :width 7in
#+RESULTS: p_cpr_scores_scat
[[file:/home/johannes/Dropbox/phd/papers/closing/notes/dimred/p_cpr_scores_scat.pdf]]


very similar: in both cases, closed ones at bottom left

look at changes within museums: end of tip is woclosed position

#+name: p_cpr_scores_diff
#+begin_src R :exports results :results output graphics file :file p_cpr_scores_diff.pdf :width 7 :height 4
p_cpr_scores_diff <- ggplot(dt_pca_cpr_scores,
                            aes(x=PC1_all, y=PC2_all, xend = PC1_woclosed*-1, yend = PC2_woclosed*-1,
                                color = museum_status)) +
  geom_point(position = position_jitter(width = 0.2, height = 0.2, seed = 10), show.legend = F, size = 0.2) + 
  geom_segment(arrow = arrow(length = unit(0.1, "cm")),
               linewidth = 0.3,
               alpha = 0.7,
               position = position_jitter(width = 0.2, height = 0.2, seed = 10))


p_cpr_scores_diff + (p_cpr_scores_diff + 
                     coord_cartesian(xlim = c(-2.5, -1.75), ylim = c(-2.5, -2))) +
  plot_layout(guides = "collect") & theme(legend.position = "bottom")

#+end_src

#+attr_latex: :width 7in
#+RESULTS: p_cpr_scores_diff
[[file:/home/johannes/Dropbox/phd/papers/closing/notes/dimred/p_cpr_scores_diff.pdf]]

overall change for each PM isn't so large, most closed PMs still stay at bottom left corner

look at mean scores on principal components by museum_status and PC construction mechanism (all vs woclosed): 

#+name: p_cpr_scores_means
#+begin_src R :exports results :results output graphics file :file p_cpr_scores_means.pdf :width 7 :height 4
melt(dt_pca_cpr_scores, id.vars =  c("ID", "museum_status"),
     measure.vars = measure(PC, src, pattern = "(PC.*)_(.*)")) %>%
    .[src == "woclosed", value := value *-1] %>% 
    .[, .(mean_value = mean(value)), .(PC, museum_status, src)] %>%
    ggplot(aes(x=museum_status, y=mean_value, fill = src, color = src)) +
    geom_col(position = position_dodge()) +
    geom_point(position = position_dodge(width = 1)) +
    geom_text(mapping = aes(label = round(mean_value, digits = 2)), position = position_dodge(width = 1),
              color = "black") + 
    facet_wrap(~PC)

#+end_src

#+attr_latex: :width 7in
#+RESULTS: p_cpr_scores_means
[[file:/home/johannes/Dropbox/phd/papers/closing/notes/dimred/p_cpr_scores_means.pdf]]

differences between groups by museum_status is much larger than differences between src

